<template lang="pug">
div(v-katex:auto)
  v-container
    v-row
      v-col(cols="12")
        h3 ピタゴラス音律
        p
          | ドの完全5度上はソでした。
          | では、もう一度完全5度上の音とってみましょう。
          | ソの完全5度上の音はレです。この音はドに対して$(3/2)^2=9/4$倍の周波数です。
          | オクターブ内に収まらないので2で割っておけば、ドに対して$9/8$倍がレになります。
          | このようにして繰り返していくと、12回目でドに近い音が得られます。
          | $(3/2)^12/2^7=1.01364326...$
          | となりますから、12回目には7オクターブ上のドより若干高い音が得られているのが分かります。
          | なのでここで打ち切って、12個の音をオクターブ内に並べます。
        p
          | これがあのピタゴラスが作った、ピタゴラス音律です。
          | 1オクターブに音が12個あるのはこれが由来だと言われています。
          | ちなみに、ドに戻ってこない分のセント差をピタゴラスコンマと言います。
        p
          | この音律では、完全5度はファからドに行くとき以外は全て良くハモります。
          | またこの、整数比で得られた完全5度を純正5度と呼びます。

        h4 ポイント
        ul
          li 完全5度上を取り続けたのがピタゴラス音律である。
          li 良くハモる3:2の比の完全5度を純正5度と言う。
          
        router-link(to="/learning/level2/3") 次のページ：純正律
</template>
