<template lang="pug">
  v-container
    v-row
      v-col(cols="12")
        h3 純正律
        p
          | 純正律はハーモニーがうならなずにハモるように作った音律でした。
          | このために、周波数がキチッとハマるようにしており、平均律とは若干音の高さが違うような音律になっています。
        p
          | 音の高さをオクターブ内で12に均等に割ったのが平均律でしたが、その中でもまた隣り合う音の高さを100で割ったものをセントと言います。
        p
          | ドの100セント上はド♯（レ♭）で、その100セント上はレです。
          | ドからオクターブ上のドまでは1200セントになります。
        p
          | これは、音の高さがどれだけ平均律からズレているかに使います。
          | 例えばドミソの和音（Cメジャー、Cドゥアー）は根音C、五音G、三音Eの和音です。
          | このとき、純正律ではCは+0セント（平均律と同じ）、Gは+2セント（平均律より少し高い）、Eは-13.7セント（平均律より低い）という感じです。
        p
          | 右上の歯車の設定ボタンから、「セント値」を表示をオンにして、平均律を選んでください。該当する音のセントが表示されます。
          | 持続したまま平均律や他の純正律に変えると、即座に音が変わります。
          | 平均律でうなり、純正律でうなりがなくなるのを感じてください。
        p
          | 純正律はドミソ、ファラド、ソシレの和音が、うならずにハモるように作ってあります。この3つの和音だけで長音階が全部埋まるためです。
          | 特にわざわざ代表で選ばれたこの3つの和音は、調性を決定付けるため、主要三和音と呼ばれています。
          | 短音階ではラドミ、レファラ、ミソシが主要三和音になります（根音をラと呼ぶとき。ドというなら長調と同じです）。
          | 以下の画像は、ハ調とイ調の長調と短調の、主要三和音を示したものです。
        
        img(src="@/assets/images/learning/main_triad.svg" width="100%")

        p
          | 実用上では純正律にも半音を導入することがありますが、純正律には半音は存在しません。
          | 長音階以外の音による和音は、そもそも不協和音なのでハモらせられません。

        h4 ポイント
        ul
          li 1オクターブを音の高さで1200個に分けたものをセントという
          li 純正律は調性を決定づける主要三和音がハモるように作られる
          li 純正律に半音階はない
          
        router-link(to="/learning/level3/1") レベルアップ…レベル３：どのようにうなりは生じるか
</template>
