<template lang="pug">
div(v-katex:auto)
  v-container
    v-row
      v-col(cols="12")
        h3 フェヒナーの法則と音高、平均律再考
        p
          | 音は波動の現象です。
          | 空気を媒質として、その疎密によって伝搬し、鼓膜を揺らします。
          | その音量は波の振幅に、音高は波の周波数に、音色は波形によって決定されます。
        p
          | 人間が知覚するものは、基本的にはその対数に比例してその感覚量が増加します。
          | これはフェヒナーの法則として知られています。
          | 式で表すと、ある刺激を受けたときの感覚量$E$は、その刺激量強度$R$と、比例定数$C$を用いて
          | $$E=C \log R$$
          | と表すことができます。
        p
          | 簡単に言えば、刺激量を2乗にすれば2倍に感じるということです。
          | 2倍の音量にするためには、振幅が2倍になるように強く演奏すれば良いと言うわけではなく、2乗になるようにしなければならないんです。
          | したがって、一定の感覚で振幅を上げても、音量の聴こえはだんだん上げ幅が緩んでいくように聴こえます。
          | クレッシェンドの演奏などのときに役立つ情報ですね。
        p
          | 以上のことは周波数と音の高さの関係にも置き換えられます。
          | よく知られる周波数$440$HzのA（ラ）音を基準に整理してみます。以降この音をA4と呼びます
        p
          | この次のA音であるA5は$880$Hzになります。
          | この関係をオクターブ（二倍周波数）と呼ぶわけですね。
        p
          | このオクターブの音程の距離感を計算しておきましょう。以降、ある音高$p$の感覚量を$P_p$と表現します。A4とA5の感覚量の差は
          | $$
          | \begin{aligned}
          |   d_{oct} &= P_{A5} - P_{A4} \\
          |   &= C \log 880 - C \log 440 \\
          |   &= C \log 2
          | \end{aligned}
          | $$
          | となります。対数で表されるということは、刺激量の差が感覚量では比になって効いてくる、というのがフェヒナーの法則のポイントです。
        p
          | 更に上のA6は、オクターブの考え方からA5の倍の周波数としても得られますが、$P_{A5}$に、$d_{oct}$を足しても同じ結果が得られます。
          | つまり、この感覚量というのは、音の高さを線形に扱うことができるということです。
          | $a$だけ増やして半音上がるなら、さらに$a$増やすとさらに半音増える、といった計算ができます。
          | これでやっと、音の高さを五線譜のような感じで扱うことができます。

        p
          | 平均律について再考します。
          | 平均律は隣り合う半音の周波数比を一定にしたもので、オクターブを12に平均して分割して得ます。
          | すなわち、半音の周波数比は、12回の掛け算で2になる数なので、$r^{12}=2$より$r=2^{1/12}$と求まります。
        p
          | 当然、感覚量を12分割することでも同じ結果が得られ
          | $$
          | \begin{aligned}
          |   \Delta d^{ave} &= \frac{d_{oct}}{12}  \\
          |   &= \frac{C}{12} \log 2 \\
          |   &= C \log 2^{1/12}
          | \end{aligned}
          |  $$
          | となり、やはり$2^{1/12}$となります。
        p
          | 平均律は、凄いことに色んな和音が均等にハモるし均等にハモらないです。
          | 絶対にオクターブしか協和しませんが、他の和音の不協和も、それほど顕著にならず、実用的です。
          
        router-link(to="/learning/level3/1") 次のページ：倍音成分の計算（フーリエ級数展開）

</template>
