<template lang="pug">
    v-row(v-katex:auto)
      v-col(cols="12")
        h3 どのようにうなりは生じるか
        p うなりについて、考えます。
        p
          | うなりは、このレベルの対象読者であれば物理基礎で習って、理解していると思いますが、数式で証明していきます。
          | 数式と聞いて身構える必要はありません。三角関数の和積の公式だけで証明できます。実質的には三角関数の加法定理だけで証明できることになります。
        p
          | まず、状況を考えます。
          | ここでは、同じ場所から、同じ方向へ同じ速さで進む、２つの異なる周波数の波の伝搬を考えます。
          | 同じスピーカーから二つの音を出せばあり得ることです（そもそもスピーカー内部の電気信号の時点で干渉が起きます）。
        p
          | それぞれの波を$w_1$と$w_2$とし、周波数は$f_1$、$f_2$とし、どちらも$\sin$波とします。
          | 波には干渉という性質があり、全ての位置での波は、それぞれの重ね合わせで表されるので
          | $$
          |  \begin{aligned}
          |    w &= w_1 + w_2 \\
          |    &= \sin(2\pi f_1 t) + \sin(2\pi f_2 t) \\
          |    &= 2\sin\left(2\pi \cfrac{f_1+f_2}{2} t\right) \cos\left(2\pi \cfrac{f_1-f_2}{2} t\right)
          |  \end{aligned}
          | $$
          | となります。積和の法則覚えていますか？
        p
          | つまり、周波数$f_1$と$f_2$の平均$(f_1+f_2)/2$の音が、その音量をこれらの周波数差の半分の周波数で変化させながら鳴ると言いそうになります。
          | しかし、$\cos$はマイナス側にもいきますが、振幅はマイナスにはなりませんから、その絶対値で変化します。
          | $\cos\left(2\pi \frac{f_1-f_2}{2} t\right)$がプラス側に大きくなったときはもちろん、マイナス側に大きくなったときにも振幅は大きくなるということです。
          | $\cos$がマイナスの時、$\sin$が上下反転したようになり、$\sin$がマイナスに行くときに、その籍としてはプラス側に行くため、このようになります。
        p
          | 周波数差がマイナスになる$f_2 > f_1$のときは、$\cos$が逆回転になるだけで、偶関数ですから、結局関係ありません。
          | したがって、実質的なうなりの周波数は、$\left|\cos\left(2\pi \frac{|f_1-f_2|}{2} t\right)\right|$の周波数と等しくなり、$\cos$の周波数の倍の$|f_1-f_2|$と言えます。
          | 物理基礎で習った内容と一致しましたでしょうか。
        p
          | 周波数の違う二つの音を鳴らせば、その差の分だけうなることがわかりました。
          | しかし、1秒間に何十回も何百回もうなれば、それはもう、うなりとは認識できません。
          | 漕ぎはじめの自転車のライトはチカチカしますが、速度が出てくるとずっとついているように見えますよね。
          | ゆっくりと振幅が変化することによって、うなりは聞き取ることができるので、同じような高さの音同士の間（ユニゾンで演奏しているときなど）でうなりは顕著になります。
        p
          | それから、和音のときも、含まれる倍音との差でうなりが生じます。
          | ドとソを鳴らした時を考えましょう。
          | この二つは完全5度と、結構離れているので、先ほどの理屈から言えばうなりは聞こえないはずです。
          | しかし、ドの自然倍音に含まれるソの音と、鳴らしたソの音の間で周波数が異なれば、やはりうなりとして聞こえてきます。
          | 和音を綺麗にハモらせるなら、ドに含まれる自然倍音と同じ高さの音で演奏せねばらなず、これが純正律へとつながっていきます。

        h4 ポイント
        ul
          li うなりは近い周波数の波同士の干渉によって生じる
          li うなりの周波数は互いの周波数の差
          li 和音の場合、自然倍音とも干渉し、うなりが生じる
          
        router-link(to="/learning/level3/2") 次のページ：純正律再考
</template>
