<template lang="pug">
div(v-katex:auto)
  v-container
    v-row
      v-col(cols="12")
        h3 純正律再考
        p もう一度純正律について考えていきます。
        p ピタゴラス音律は、完全5度を繰り返していきましたが、これだと完全5度しかハモらないことになります。
        p
          | 音楽の調性を決定付ける和音に、主要三和音と呼ばれるものがあります。
          | これは、その調におけるI、IV、Vの和音です。
          | C-durであればC(C,E,G)、F(F,A,C)、G(G,B,D)の3つで、a-mollであればAm(A,C,E)、Dm(D,F,A)、Em(E,G,B)です。
        p
          | 純正律では、この主要三和音をうまくハモらせるように作ります。
          | すなわち、完全5度だけでなく長/短3度も純正音程でとります。
        p
          | 倍音列の第5倍音は、基音に対して2オクターブと長3度のミの音でした。
          | つまり、2オクターブ下げるために4で割って、5/4倍の周波数の音が純正長3度となります。
        p
          | ミとソの音程は短3度です。純正でドミソを鳴らせば良くハモりますから、ミとソも良くハモっているはずです。
          | したがって、純正5度と純正長3度から純正短3度を求められます。
          | $$
          |   \frac{3/2}{5/4}=\frac{3}{2}\times\frac{4}{5}=\frac{6}{5}
          | $$
          | よって、純正短3度は5:6の周波数比で作ることができます。

        h4 ポイント
        ul
          li 調性を決定付ける3つの和音、I、IV、Vの和音のことを主要三和音という
          li 純正律は主要三和音を純正音程にとった音律である
          li 純正5度は基音の周波数の3/2倍、純正長3度は5/4倍、純正短3度は6/5倍で得られる
          
        router-link(to="/learning/level3/3") 次のページ：純正律の周波数を求める
</template>
